Tecnologia/Support Tècnic/36340003.md

Suport Tècnic : eNOTUM - FLUX DEL SERVEI- Anular notificació.  

1.  [Suport Tècnic](index.md)
2.  [Suport Tècnic](13893782.md)
3.  [02 - FAQ's serveis](26313393.md)
4.  [FAQ's ENOTUM](28705561.md)
5.  [eNOTUM - FLUX DEL SERVEI - Procediments i configuracions](eNOTUM---FLUX-DEL-SERVEI---Procediments-i-configuracions_36341299.md)

Suport Tècnic : eNOTUM - FLUX DEL SERVEI- Anular notificació.
=============================================================

Created by Unknown User (otecagonzalez), last modified by Joan Riquelme on 26 March 2025

Durem a terme aquest procediment quan ens demanin anular una notificació.

Anul·lem les notificacions amb una crida webService explícita per això, mitjançant SoapUI.

Per tant, la crida que utilitzem és la següent, i apuntem a l'endpoint [http://enotum.int.aoc.cat:8083/services/eNotum](http://enotum.int.aoc.cat:8083/services/eNotum "http://enotum.int.aoc.cat:8083/services/enotum") :

**Crida anul·lar notificació**

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <open:procesa>
         <PeticioAnullacio xmlns="http://www.aocat.net/NT/v4.0">
            <Usuari>
               <Empleat>
                  <CodiOrganisme>XXXXX</CodiOrganisme>
                  <CodiDepartament>XXXXX</CodiDepartament>
               </Empleat>
            </Usuari>
            <IdNotificacio>XXXX</IdNotificacio>
            <Motiu>XXXXXXXXXXX</Motiu>
         </PeticioAnullacio>
      </open:procesa>
   </soapenv:Body>
</soapenv:Envelope>

On omplim els camps de la següent manera:

CodiOrganisme: id\_ens de l'entitat pare.

CodiDepartament: id\_ens de l'entitat filla.

Per cercar els id\_ens:

select noti.id\_notificacio, ent2.id\_ens as CodiOrganisme,ent.id\_ens as CodiDepartament from nt30.aoc\_nt\_notificacions noti 
inner join nt30.aoc\_nt\_entitat ent on (noti.id\_entitat = ent.id\_entitat)
inner join nt30.aoc\_nt\_entitat ent2 on (ent.id\_entitat\_pare = ent2.id\_entitat)
where noti.ID\_NOTIFICACIO='81296313';

![](attachments/36340003/124912170.png)

Deixo aqui el projecte SoapUI que faig servir jo: [NT-ANULACIONS.zip](attachments/36340003/118554927.zip)

Attachments:
------------

![](images/icons/bullet_blue.gif) [NT-ANULACIONS.zip](attachments/36340003/118554927.zip) (application/zip)  
![](images/icons/bullet_blue.gif) [image2025-3-6\_13-49-12.png](attachments/36340003/124912170.png) (image/png)  

Document generated by Confluence on 02 June 2025 10:53

[Atlassian](http://www.atlassian.com/)